Added README. Changed posts layout to Wide. Migrated 2022 to 2024 posts diagram to PlantUML.
