--- a/docs/_posts/2022-06-17-solving-dual-writes-with-cdc-and-the-outbox-pattern.md
+++ b/docs/_posts/2022-06-17-solving-dual-writes-with-cdc-and-the-outbox-pattern.md
@@ -44,13 +44,42 @@ Databases provide CDC in one of these two flavors:
 This design provides an atomicity guarantee that the message is always produced (eventually) and always after the database writing.
 
-{:style="text-align:center;"}
-```mermaid!
-flowchart LR
-    A(Order service) --> |Insert Order| B[(Order table)]
-    B --> |CDC| C(Message producer)
-    C --> |OrderCreated| D[/Messaging platform/]
-```
+```plantuml!
+@startuml
+
+!theme bluegray
+skinparam DatabaseBackgroundColor #FFFFFF
+skinparam DatabaseBorderColor #acacac
+skinparam DatabaseFontColor #5a5a5a
+skinparam QueueBackgroundColor #FFFFFF
+skinparam QueueBorderColor #acacac
+skinparam QueueFontColor #5a5a5a
+skinparam backgroundColor #FFFFFF
+skinparam ArrowColor Gray
+left to right direction
+
+rectangle order_service [
+    **Order service**
+]
+
+database order_table [
+    **Order table**
+]
+
+rectangle message_producer [
+    **Message producer**
+]
+
+queue messaging_platform [
+    **Messaging platform**
+]
+
+order_service --> order_table : Insert Order
+order_table --> message_producer : CDC
+message_producer --> messaging_platform : OrderCreated
+
+@enduml
+```{: .align-center}
 
 This is an idea I explored in a previous work when refactoring a project, and while it is on the right track I realized this would be a bad idea.
 
@@ -72,14 +101,47 @@ A workflow can either do both data and message writing atomically in a database 
 Also, the workflows have full control over defining and populating the message.
 
-{:style="text-align:center;"}
-```mermaid!
-flowchart TD
-    A(Order service) --> |Insert Order| B[(Order table)]
-    A(Order service) --> |Insert OrderCreated| C[(OrderCreated outbox table)]
-    C --> |Change captured| D(Message producer)
-    D --> |OrderCreated| E[/Messaging platform/]
-```
+```plantuml!
+@startuml
+
+!theme bluegray
+skinparam DatabaseBackgroundColor #FFFFFF
+skinparam DatabaseBorderColor #acacac
+skinparam DatabaseFontColor #5a5a5a
+skinparam QueueBackgroundColor #FFFFFF
+skinparam QueueBorderColor #acacac
+skinparam QueueFontColor #5a5a5a
+skinparam backgroundColor #FFFFFF
+skinparam ArrowColor Gray
+top to bottom direction
+
+rectangle order_service [
+    **Order service**
+]
+
+database order_table [
+    **Order table**
+]
+
+database outbox_table [
+    **OrderCreated outbox table**
+]
+
+rectangle message_producer [
+    **Message producer**
+]
+
+queue messaging_platform [
+    **Messaging platform**
+]
+
+order_service --> order_table : Insert Order
+order_service --> outbox_table : Insert OrderCreated
+outbox_table --> message_producer : Change captured
+message_producer --> messaging_platform : OrderCreated
+
+@enduml
+```{: .align-center}
 
 The outbox pattern guarantees the message is eventually produced to the messaging platform, and it increases the workflow availability by depending only on the database availability.
 
